### 데이터프레임의 각 행에 함수 매핑
- df 객체에 apply(axis = 1) 메소드를 적용하면 df의 각 행을 매핑 함수의 인자로 전달
- df 행 인덱스가 매칭 결과로 반환되는 시리즈의 인덱스가 된다.
- 시리즈의 인덱스에 매칭되는 데이터 값에는 각 행의 데이터를 함수에 적용한 리턴 값을 가져옴 
- df 행에 함수 매핑 : DataFrame 객체.apply(매핑 함수, axis = 1)

In [1]:
import seaborn as sns 

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']] 

df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [2]:
df['ten'] = 10 
df.head()

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [3]:
def add_two_obj(a, b):
    return a + b

In [5]:
x = df
df['add'] = df.apply(lambda x : add_two_obj(x['age'], x['ten']), axis = 1)
df.head()

    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0